//#1
//  UFT-8 აძლევს საშვალებას კომპიუტერს რომ ყველა ენა სწორად წაიკითხოს თავისი სიმბოლოებით

// #2
import { writeFileSync } from "node:fs";

writeFileSync("file1.txt", "1 st", "utf-8");
writeFileSync("file2.txt", "2 Nd", "utf-8");
writeFileSync("file3.txt", "3 th", "utf-8");
writeFileSync("file4.txt", "4 th", "utf-8");
writeFileSync("file5.txt", "5 th", "utf-8");

//#3
// იმიტომ არ ვქმნით ხელით ფაილებს რომ მაგალიუთად როცა დავება გვაქვს რომ 100 ფაილი უბდა სევქმნათ და შიგნით ტექსტი ჩავწეროთ, ხელით რთულია ამიტომაც ასე მარტივად შეგვიძლია ფაილების შექმნა.

//#4
// რომ წავიკითხოთ ფაილები,სევქმნათ ფაილები,ჩავწეროთ მონაცემები და წავსალოთ ფაილები ამისთვისაა იმპორტი საჭირო

//#5
// ReadFile აძლევს კომპიუტერს სასვალებას რომ წაიკითხოს ფაილსი მოცემული მონაცემები
