
function nav(){

    return(
        <div>
        <nav className="nav"></nav>
        {/* ახსენით რა არის კომპონენტები  React ში და რა უპირატესობა აქვს მას HTML ის ჩვეულებრივ კოდთან შედარებით. რა უპირატესობა აქვს პროექტის   დაყოფას მრავალ კომპონენტებად ? */}
        {/* რეაქტში კომპონენტები არის შენით მოფიქრებული თეგები და კარგი ისაა რომ ამ თეგებს შეგიძლია თვისი ფუნქცია მიანიჭო და გამოსადეგარია */}
        {/*  ახსენით როგორ იწერება JSX კოდი ,  შექმენით Header კომპონენტი რომელიც დაარენდერებს საიტის სათაურს ლოგოს */}
        {/* იწერება html და js ით */}
        {/* შექმენით Nav კომპონენტი რომელიც შეიცავს სანავიგაციო ლინკებს */}
        </div>
    )

}
export default nav;