
export default function Nav() {

    return (
        <div>
            <nav className="nav">
                <button>1</button>
                <button>2</button>
                <button>3</button>
                <button>4</button>
                <button>5</button>
            </nav>
            {/* ახსენით რა არის კომპონენტები  React ში და რა უპირატესობა აქვს მას HTML ის ჩვეულებრივ კოდთან შედარებით. რა უპირატესობა აქვს პროექტის   დაყოფას მრავალ კომპონენტებად ? */}
            {/* რეაქტში კომპონენტები არის შენით მოფიქრებული თეგები და კარგი ისაა რომ ამ თეგებს შეგიძლია თვისი ფუნქცია მიანიჭო და გამოსადეგარია */}
            {/*  ახსენით როგორ იწერება TSX კოდი ,  შექმენით Header კომპონენტი რომელიც დაარენდერებს საიტის სათაურს ლოგოს */}
            {/* იწერება html და typescript ით */}
            {/* შექმენით Nav კომპონენტი რომელიც შეიცავს სანავიგაციო ლინკებს */}
        </div>
    )

}
